app/controllers/empresas_controller.rb

  def index
    @empresas = Empresa.all
---
SELECT "empresas".* FROM "empresas"

  def create
    @empresa = Empresa.new(empresa_params)
    if @empresa.save
---
INSERT INTO "empresas" ("id_empresa", "endereco", "cnpj", "telefone", "nome", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def update
    if @empresa.update(empresa_params)
---
UPDATE "empresas" SET "endereco" = ?, "updated_at" = ? WHERE "empresas"."id" = ?  [["endereco", "Rua Olimpia, 436"], ["updated_at", "2024-11-26 14:46:16.344105"], ["id", 1]]

  def destroy
    @empresa.destroy
---
DELETE FROM "empresas" WHERE "empresas"."id" = ?  [["id", 1]]

  def set_empresa
    @empresa = Empresa.find(params[:id])
---
SELECT "empresas".* FROM "empresas" WHERE "empresas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]