app/controllers/funcionarios_controller.rb

SELECT "funcionarios".* FROM "funcionarios"
---
    def index
      @funcionarios = Funcionario.all

INSERT INTO "funcionarios" ("id_funcionario", "created_at", "updated_at", "empresa_id", "nome", "cpf", "endereco") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
    def create
      @funcionario = Funcionario.new(funcionario_params)
      if @funcionario.save

UPDATE "funcionarios" SET "id_funcionario" = ?, "updated_at" = ?, "nome" = ?, "cpf" = ?, "endereco" = ? WHERE "funcionarios"."id" = ?  [["id_funcionario", 2], ["updated_at", "2024-11-26 15:09:23.076527"], ["nome", "Karim Bale"], ["cpf", "124.576.521-34"], ["endereco", "Rua França, 43"], ["id", 2]]
---
    def update
      if @funcionario.update(funcionario_params)

DELETE FROM "funcionarios" WHERE "funcionarios"."id" = ?  [["id", 3]]
---
    def destroy
      @funcionario.destroy

SELECT "funcionarios".* FROM "funcionarios" WHERE "funcionarios"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_funcionario
      @funcionario = Funcionario.find(params[:id])