app/controllers/pagamentos_controller.rb

SELECT "pagamentos".* FROM "pagamentos"
---
    def index
      @pagamentos = Pagamento.all