app/controllers/pagamentos_controller.rb

INSERT INTO "pagamentos" ("tipo", "created_at", "updated_at", "venda_id_empresa", "compra_id_empresa") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["tipo", "Dinheiro"], ["created_at", "2024-11-26 15:20:10.956842"], ["updated_at", "2024-11-26 15:20:10.956842"], ["venda_id_empresa", 2], ["compra_id_empresa", 3]]
---
    def create
      @pagamento = Pagamento.new(pagamento_params)
      if @pagamento.save

DELETE FROM "pagamentos" WHERE "pagamentos"."id" = ?  [["id", 3]]
---
    def destroy
      @pagamento.destroy

SELECT "pagamentos".* FROM "pagamentos" WHERE "pagamentos"."venda_id_empresa" = ? AND "pagamentos"."compra_id_empresa" = ? LIMIT ?  [["venda_id_empresa", 20], ["compra_id_empresa", 20], ["LIMIT", 1]]
---
    def list_payment_by_company
      empresa_id = params.require(:id)

      @pagamentos = Pagamento.find_by(venda_id_empresa: empresa_id, compra_id_empresa: empresa_id)

SELECT "pagamentos".* FROM "pagamentos" WHERE "pagamentos"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_pagamento
      @pagamento = Pagamento.find(params[:id])