app/controllers/produtos_controller.rb

SELECT "produtos".* FROM "produtos" WHERE "produtos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_product
    @product = Produto.find(params[:id])