app/controllers/produtos_controller.rb

SELECT "produtos".* FROM "produtos"
---
  def index
    @produtos = Produto.all

INSERT INTO "produtos" ("tipo", "peso", "created_at", "updated_at", "nome", "estoque_id") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["tipo", "plastico"], ["peso", 10.0], ["created_at", "2024-12-01 18:44:32.750558"], ["updated_at", "2024-12-01 18:44:32.750558"], ["nome", "Garrafa PET"], ["estoque_id", nil]]
---
  def create
    @produto = Produto.new(produto_params)

    respond_to do |format|
      if @produto.save

UPDATE "produtos" SET "peso" = ?, "updated_at" = ? WHERE "produtos"."id" = ?  [["peso", 2.0], ["updated_at", "2024-11-26 14:57:38.468433"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @produto.update(produto_params)

DELETE FROM "produtos" WHERE "produtos"."id" = ?  [["id", 3]]
---
  def destroy
    @produto.destroy!

SELECT "produtos".* FROM "produtos" WHERE "produtos"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_produto
      @produto = Produto.find(params[:id])