app/controllers/produto_pagamentos_controller.rb

SELECT "produto_pagamentos".* FROM "produto_pagamentos"
---
    def index
      @produto_pagamentos = ProdutoPagamento.all

SELECT "pagamentos".* FROM "pagamentos" WHERE "pagamentos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_produto_pagamento
      @produto_pagamento = ProdutoPagamento.find(params[:id])